In [1]:
import module as mo

In [2]:
df = mo.first()

In [3]:
df

   id name   userid        psw  Lv  Exp
0   6  고건영   012345  123451234   1    0
1   7  강지원     8262       0508  30   50
2   8  병정1     1234       5959  29   40
3   9  병정2     1254       6234  15   30
4  10  병정3     6234       3174   5   10
5  11  병정4  1461364   34163164   1   80
6  12  병정5    23612      12365  10   40

In [37]:
dic = df[['name','Lv','Exp']].sort_values(by=['Lv','Exp'],ascending=False)

In [ ]:
df[['name','Lv','Exp']].sort_values()

In [41]:
dic = dic.T.to_dict()

In [52]:
for i,k in dic.items():
    for j,h in k.items():
        print(j,h,end=' ')
    print('-----')

name 강지원 Lv 30 Exp 50 -----
name 병정1 Lv 29 Exp 40 -----
name 병정2 Lv 15 Exp 30 -----
name 병정5 Lv 10 Exp 40 -----
name 병정3 Lv 5 Exp 10 -----
name 병정4 Lv 1 Exp 80 -----
name 고건영 Lv 1 Exp 0 -----

In [23]:
dic.values()

dict_values([{1: '강지원', 2: '병정1', 3: '병정2', 6: '병정5', 4: '병정3', 5: '병정4', 0: '고건영'}, {1: 30, 2: 29, 3: 15, 6: 10, 4: 5, 5: 1, 0: 1}, {1: 50, 2: 40, 3: 30, 6: 40, 4: 10, 5: 80, 0: 0}])

In [36]:
dic

{'name': {1: '강지원',
  2: '병정1',
  3: '병정2',
  6: '병정5',
  4: '병정3',
  5: '병정4',
  0: '고건영'},
 'Lv': {1: 30, 2: 29, 3: 15, 6: 10, 4: 5, 5: 1, 0: 1},
 'Exp': {1: 50, 2: 40, 3: 30, 6: 40, 4: 10, 5: 80, 0: 0}}

In [21]:
)dic.items()

dict_items([('name', {1: '강지원', 2: '병정1', 3: '병정2', 6: '병정5', 4: '병정3', 5: '병정4', 0: '고건영'}), ('Lv', {1: 30, 2: 29, 3: 15, 6: 10, 4: 5, 5: 1, 0: 1}), ('Exp', {1: 50, 2: 40, 3: 30, 6: 40, 4: 10, 5: 80, 0: 0})])